uat_chat/DataProcessors/уатРасстоянияМеждуПунктами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DataProcessor>
		<Properties>
			<Name>уатРасстоянияМеждуПунктами</Name>
			<Comment>(уат)</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пункт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаРасстояний</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пункт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расстояние</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

uat_chat/InformationRegisters/уатРасстоянияМеждуПунктами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>уатРасстоянияМеждуПунктами</Name>
			<Comment>(уат)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Расстояние</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пункт1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пункт2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

uat_chat/DataProcessors/уатРасстоянияМеждуПунктами/Ext/ObjectModule.bsl
// Процедура по заданным значениям реквизитов перезаполняет
// данными табличную часть
//
// Параметры
//  НЕТ
// Возвращаемые значения
//  НЕТ
Процедура ОбновитьТаблицу() Экспорт

	ТаблицаРасстояний.Очистить();
	
	Если ЗначениеЗаполнено(Пункт)Тогда
		
		Запрос = Новый Запрос();

		Запрос.УстановитьПараметр("Пункт" , Пункт);

		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ВЫБОР КОГДА уатРасстоянияМеждуПунктами.Пункт1 = &Пункт ТОГДА уатРасстоянияМеждуПунктами.Пункт2 ИНАЧЕ уатРасстоянияМеждуПунктами.Пункт1 КОНЕЦ КАК Пункт,
		               |	уатРасстоянияМеждуПунктами.Расстояние
		               |ИЗ
		               |	РегистрСведений.уатРасстоянияМеждуПунктами КАК уатРасстоянияМеждуПунктами
		               |
		               |ГДЕ
		               |	(уатРасстоянияМеждуПунктами.Пункт1 = &Пункт ИЛИ уатРасстоянияМеждуПунктами.Пункт2 = &Пункт)";

		ТаблицаРасстояний.Загрузить(Запрос.Выполнить().Выгрузить());
		
	КонецЕсли; 
	
КонецПроцедуры

// Процедура обрабатывает действие начала редактирования или ввода новой
// записи контактной информации
//
// Параметры
//  ВыбОбъект - объект уже существующей записи в регистре контактной информации
//  ВыбТип - тип уже существующей или новой записи в регистре контактной информации
//  ВыбВид - вид уже существующей или новой записи в регистре контактной информации
//  ТекущийОбъект - Объект новой записи в регистре контактной информации
//  ФормаВладелец - форма из которой произошел вызов процедуры
// Возвращаемые значения
//  НЕТ
Процедура РедактироватьЗапись(Пункт, Расстояние, ТекущийОбъект, ФормаВладелец, Копирование = Ложь) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.уатРасстоянияМеждуПунктами.СоздатьМенеджерЗаписи();

	Если уатОбщегоНазначения.уатЗначениеНеЗаполнено(Пункт) Тогда
		// Выбрали запись, которой еще нет в регистре
		МенеджерЗаписи.Пункт1    = ТекущийОбъект;
		
	Иначе
		
		МенеджерЗаписи.Пункт1 = Пункт;
		МенеджерЗаписи.Пункт2 = ТекущийОбъект;
		МенеджерЗаписи.Прочитать();
		
		Если НЕ МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.Пункт2 = Пункт;
			МенеджерЗаписи.Пункт1 = ТекущийОбъект;
			МенеджерЗаписи.Прочитать();
		КонецЕсли;
		
	КонецЕсли; 

	ФормаЗаписи = МенеджерЗаписи.ПолучитьФорму();
	ФормаЗаписи.ВладелецФормы = ФормаВладелец;
	ФормаЗаписи.ЗакрыватьПриВыборе = Ложь;
	ФормаЗаписи.Открыть();

КонецПроцедуры

 #Если Клиент Тогда

// Процедура обрабатывает действие удаления
// записи контактной информации
//
// Параметры
//  ВыбОбъект - объект уже существующей записи в регистре контактной информации
//  ВыбТип - тип уже существующей или новой записи в регистре контактной информации
//  ВыбВид - вид уже существующей или новой записи в регистре контактной информации
// Возвращаемые значения
//  НЕТ
Процедура УдалитьЗапись(ВыбОбъект, ТекущийОбъект) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.уатРасстоянияМеждуПунктами.СоздатьМенеджерЗаписи();
	
	Если (уатОбщегоНазначения.уатЗначениеНеЗаполнено(ВыбОбъект)) или (уатОбщегоНазначения.уатЗначениеНеЗаполнено(ТекущийОбъект)) Тогда
		// Выбрали запись, которой еще нет в регистре
		Возврат;
	Иначе
		МенеджерЗаписи.Пункт1 = ВыбОбъект;
		МенеджерЗаписи.Пункт2 = ТекущийОбъект;
		МенеджерЗаписи.Прочитать();

		Если МенеджерЗаписи.Выбран() Тогда
			ОтветНаВопрос = Вопрос("Удалить запись?", РежимДиалогаВопрос.ДаНет);
			Если ОтветНаВопрос  = КодВозвратаДиалога.Да Тогда
				МенеджерЗаписи.Удалить();
			КонецЕсли; 
		Иначе
			МенеджерЗаписи.Пункт2 = ВыбОбъект;
			МенеджерЗаписи.Пункт1 = ТекущийОбъект;
			МенеджерЗаписи.Прочитать();

			Если МенеджерЗаписи.Выбран() Тогда
				ОтветНаВопрос = Вопрос("Удалить запись?", РежимДиалогаВопрос.ДаНет);
				Если ОтветНаВопрос  = КодВозвратаДиалога.Да Тогда
					МенеджерЗаписи.Удалить();
				КонецЕсли; 
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецЕсли
